Autodesk.Revit.DB.GeometrySerializationUtils.Version
The current version of the geometry serialization format.

Autodesk.Revit.DB.GeometrySerializationUtils.SerializeGeometryAsBinaries(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.IATFGeometrySerializationIdConverter)
Converts GeometryElement of an Element to binary format.
document:
The document from which the Element originates.
elementId:
The Id of the Element to which the GeometryElement belongs.
geometry:
The GeometryObjects to serialize.
idConverter:
The converter used to convert Element Ids to external Ids.
Returns:
The Blobs resulting from the conversion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.GeometrySerializationUtils
This class provides utilities related to geometry serialization.